
import random

# Define two sets of constants

source_constants = ['சுசீந்திரன் அருள்ராஜ் ஹர்ஷியன்','மேகவண்ணன் வருண்','சரவணபவன் தாமிரன்','சிவகுமார் அருண்','சந்திரகுமார் தர்ஷன்','ஸ்ரீனிவாசன் அபிலாஷ்','தர்மபாலன் சதுவாசகன்','ஸ்ரீ சுஜானி சிவயோகேஸ்வரஷர்மா','ஜோன் தேவதாஸ் ஜொஷியா','ஷஹானா சின்னையா','பவிஷா தவேஸ்வரன்','சுரேஷ்குமார் ராம்சரண்','விஜயானந்தமூர்த்தி அபிஷேக்','ராஜாராம் சூர்யா','புராதனி நித்தியானந்தம்','மனோகரன் அபிவருண்','ஜெகதீஸ்வரன் கிரியங்கரன்','ஆனந்தி ஸ்ரீதரன் ','ஹரிஷனா சுரேஷ்குமார்','A']
target_constants = ['சுதர்சன் குற்றாலன் ','பார்த்திபன் லக்ஷ்மன்','நித்தியகுமார் சயனுதன்','பிரபாகரன் பேருஷன் ','தவராசா ராகுல்','சிவகுமார் துவாரகா','சிவகணேசன் மயுரேஷ்','சுரேஷ் லதூஷன்','ராசேந்திரம் ஸபரீசன்','விஜயகுமார் கிருஷிகேசன்','திருச்செல்வம் அபிகீர்த்தன்','தக்ஷன்னா தெய்வேந்திரன்','நேசராஜ் டனுஷ்டன்','நிலாதரன் ரேணுராஜ்','தமிழ்செல்வம் தனேஷ்','சிங்கராஜா ரபிலக்ஷன்','சிவக்குமார் கிர்ஷிகன்','மோனிக்கா நரேந்திரநாத்','அன்டன் மேனுஜன்','கலைஞானசுந்தரம் நிகிதன்']





# Randomly assign source constants to target constants
assignments = dict(zip(target_constants, random.sample(source_constants, len(target_constants))))

# Print the assignments
for target, source in assignments.items():
    print(f"{target} -> {source}") 